      *-------------------------------------------------------*
      *                CADASTRO DE DESPREZADOS                *
      *-------------------------------------------------------*

       FD  CADDSP          RECORD      CONTAINS 40 CHARACTERS           00660059
                           RECORDING   MODE     IS F                    00670059
                           LABEL       RECORD   IS STANDARD             00680059
                           DATA        RECORD   IS REG-DSP.             00690059
                                                                        00700059
       01  REG-DSP.                                                     00710059
           03  COD-DSP         PIC  9(05).                              00720059
           03  QTD-DSP         PIC  9(05).                              00730059
           03  DTA-DSP         PIC  9(06).                              00740059
           03  COT-DSP.                                                 00750059
               05  FOR-DSP     PIC  9(05).                              00760059
               05  VLC-DSP     PIC  9(13)V99.                           00770059
           03  FILLER          PIC  X(04).                              00780059
                                                                        00790032
