      *-------------------------------------------------------*
      *                 CADASTRO DE MATERIAIS                 *
      *-------------------------------------------------------*
                                                                        00260031
       FD  CADMAT          RECORD      CONTAINS 40 CHARACTERS           00270071
                           RECORDING   MODE     IS F                    00280001
                           LABEL       RECORD   IS STANDARD             00290001
                           DATA        RECORD   IS REG-MAT.             00300070
                                                                        00310031
       01  REG-MAT.                                                     00320070
           03  COD-MAT     PIC  9(05).                                  00330070
           03  NOM-MAT     PIC  X(20).                                  00340071
           03  QTD-MAT     PIC  9(05).                                  00350070
           03  PRC-MAT     PIC  9(05)V99.                               00360071
           03  FILLER      PIC  X(03).                                  00370071
                                                                        00380032
