      *-------------------------------------------------------*
      *                   CADASTRO DE PECAS                   *
      *-------------------------------------------------------*

       FD  CADPEC          RECORD      CONTAINS 80 CHARACTERS           00270001
                           RECORDING   MODE     IS F                    00280001
                           LABEL       RECORD   IS STANDARD             00290001
                           DATA        RECORD   IS REG-PEC.             00300001
                                                                        00310031
       01  REG-PEC.                                                     00320001
           03  COD-PEC     PIC  9(05).                                  00330005
           03  NOM-PEC     PIC  X(30).                                  00340005
           03  QTD-PEC     PIC  9(05).                                  00350005
           03  MIN-PEC     PIC  9(05).                                  00360005
           03  MAX-PEC     PIC  9(05).                                  00370005
           03  FOR-PEC     PIC  X(05).                                  00380005
           03  PRU-PEC     PIC  9(07)V99.                               00390005
           03  PRD-PEC     PIC  9(07)V99.                               00400005
           03  TIP-PEC     PIC  X(01).                                  00410005
           03  FILLER      PIC  X(06).                                  00420005
                                                                        00430032
