//JCDCLGEN JOB DBADB2JC,MSGCLASS=A,CLASS=C,NOTIFY=ALU0407
//*
//JOBLIB   DD  DSN=SYS2.DB2.SDSNLOAD,DISP=SHR
//*
//*        CRIA DCLGEN DA TABELA (AMBIENTE DESENVOLVIMENTO)
//*
//DCLGEN  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD *
DSN SYSTEM(DB2N)
DCLGEN TABLE(DBADB2.TABALU)         +
LIBRARY('ABS.FONTES.BOOKS(DB2ALU)') +
ACTION(REPLACE)                     +
LANGUAGE(COB2)                      +
STRUCTURE(DB2ALU)                   +
APOST
//*