//JCRIATAB JOB DBADB2JC,MSGCLASS=A,CLASS=C,NOTIFY=ALU0407
//*
//JOBLIB  DD  DSN=SYS2.DB2.SDSNLOAD,DISP=SHR
//*
//*       STEP  1: CREATE SAMPLE STORAGE GROUPS, TABLESPACES
//*
//PH01S01 EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD *
 DSN SYSTEM(DB2N)
 RUN  PROGRAM(DSNTIAD) PLAN(DSNTIA51) -
      LIB('SYS2.DB2.RUNLIB.LOAD')
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSIN    DD *
 CREATE DATABASE ABSDB01
   STOGROUP  JAKASTG1
   BUFFERPOOL BP0
   CCSID EBCDIC;

 COMMIT ;

 CREATE TABLESPACE  TSABS01 IN ABSDB01
   BUFFERPOOL BP0
   LOCKSIZE   ANY
   SEGSIZE    4
   CLOSE      NO
   USING STOGROUP  JAKASTG1
   PRIQTY     48
   SECQTY     48
   ERASE      NO
   PCTFREE    10
   FREEPAGE   0;

  COMMIT ;

   CREATE TABLE DBADB2.TABALU
  (
   MAT_ALU    SMALLINT    NOT NULL,
   NOM_ALU    CHAR(30)    NOT NULL,
   CUR_ALU    CHAR(20)    NOT NULL,
   TUR_ALU    CHAR(15)    NOT NULL,
   END_ALU    CHAR(30)    NOT NULL,
   BAI_ALU    CHAR(20)    NOT NULL,
   CID_ALU    CHAR(25)    NOT NULL,
   EST_ALU    CHAR(02)    NOT NULL,
   EML_ALU    CHAR(30)    NOT NULL,
   TEL_ALU    CHAR(15)
   )
    IN ABSDB01.TSABS01
    ;

     CREATE    UNIQUE     INDEX
     DBADB2.ITABALU  ON   DBADB2.TABALU
                          (MAT_ALU ASC)

 ;
    ALTER TABLE DBADB2.TABALU
      PRIMARY KEY (MAT_ALU)
;
GRANT SELECT,INSERT,UPDATE,DELETE ON DBADB2.TABALU TO PUBLIC;
//
