//JEXEBIND JOB IBMUSERC,MSGCLASS=A,CLASS=C,NOTIFY=ALU0407
//*
//*        EXECUTAR O BIND DO PACKAGE
//*
//BIND     EXEC PGM=IKJEFT01,DYNAMNBR=50
//STEPLIB  DD   DISP=SHR,DSN=SYS2.DB2.SDSNLOAD
//         DD   DISP=SHR,DSN=SYS2.CICSTS13.SDFHLOAD
//DBRMLIB  DD   DISP=SHR,DSN=SYS2.DB2.DBRMLIB.DATA
//SYSTSPRT DD   SYSOUT=*
//SYSPRINT DD   SYSOUT=*
//SYSIN    DD   *
//SYSTSIN  DD   *
  DSN  SYSTEM(DB2N)
  BIND PLAN(PRGDB2R) MEM(PRGDB2R) ACT(REP) ISOLATION(CS)  -
       LIB('SYS2.DB2.DBRMLIB.DATA')
  END
//*