MAPDB2O DFHMSD TYPE=MAP,                                               X00010000
               TIOAPFX=YES,                                            X00020000
               MODE=INOUT,                                             X00030000
               CTRL=(FREEKB,FRSET),                                    X00040000
               MAPATTS=COLOR,                                          X00050000
               LANG=COBOL                                               00060000
*=====================================================================  00070006
MAPDB2O DFHMDI SIZE=(24,80),LINE=01,COLUMN=01                           00080000
*---------------------------------------------------------------------  00090006
        DFHMDF POS=(02,01),LENGTH=05,ATTRB=PROT,                       X00100000
               COLOR=YELLOW,                                           X00110000
               INITIAL='DATA:'                                          00120000
                                                                        00130000
TDATA   DFHMDF POS=(02,07),LENGTH=08,ATTRB=PROT,                       X00140000
               COLOR=YELLOW                                             00150000
                                                                        00160006
        DFHMDF POS=(02,22),LENGTH=40,ATTRB=PROT,                       X00170000
               COLOR=YELLOW,                                           X00180000
               INITIAL='FUTURE SCHOOL - CADASTRO DE ALUNOS (DB2)'       00190000
                                                                        00200006
        DFHMDF POS=(02,68),LENGTH=05,ATTRB=PROT,                       X00210000
               COLOR=YELLOW,                                           X00220000
               INITIAL='HORA:'                                          00230000
                                                                        00240000
THORA   DFHMDF POS=(02,74),LENGTH=05,ATTRB=PROT,                       X00250000
               COLOR=YELLOW                                             00260000
                                                                        00270006
        DFHMDF POS=(04,01),LENGTH=06,ATTRB=PROT,                       X00280000
               COLOR=YELLOW,                                           X00290000
               INITIAL='TRANS:'                                         00300000
*---------------------------------------------------------------------  00310006
TTRNS   DFHMDF POS=(04,08),LENGTH=04,ATTRB=PROT,                       X00320000
               COLOR=YELLOW                                             00330000
                                                                        00340006
        DFHMDF POS=(04,29),LENGTH=11,ATTRB=PROT,                       X00350000
               COLOR=TURQUOISE,                                        X00360000
               INITIAL='OPERACAO ->'                                    00370000
                                                                        00380000
TOPR1   DFHMDF POS=(04,41),LENGTH=09,ATTRB=PROT,                       X00390000
               COLOR=GREEN,                                            X00400000
               INITIAL=' '                                              00410000
                                                                        00420006
        DFHMDF POS=(04,68),LENGTH=05,ATTRB=PROT,                       X00430000
               COLOR=YELLOW,                                           X00440000
               INITIAL='TERM:'                                          00450000
                                                                        00460000
TTERM   DFHMDF POS=(04,74),LENGTH=05,ATTRB=PROT,                       X00470000
               COLOR=YELLOW                                             00480000
*---------------------------------------------------------------------  00490006
        DFHMDF POS=(08,01),LENGTH=10,ATTRB=PROT,                       X00500004
               COLOR=TURQUOISE,                                        X00510000
               INITIAL='MATRICULA:'                                     00520000
                                                                        00530000
TMTRC   DFHMDF POS=(08,12),LENGTH=05,ATTRB=(UNPROT,IC),                X00540006
               COLOR=GREEN,                                            X00550006
               INITIAL='00000'                                          00560006
        DFHMDF POS=(08,18),ATTRB=ASKIP                                  00570006
*---------------------------------------------------------------------  00580006
        DFHMDF POS=(11,01),LENGTH=10,ATTRB=PROT,                       X00590004
               COLOR=TURQUOISE,                                        X00600000
               INITIAL='NOME.....:'                                     00610000
                                                                        00620000
TNOME   DFHMDF POS=(11,12),LENGTH=30,ATTRB=PROT,                       X00630006
               COLOR=GREEN,                                            X00640006
               INITIAL=' '                                              00650006
        DFHMDF POS=(11,43),ATTRB=ASKIP                                  00660006
*---------------------------------------------------------------------  00670006
        DFHMDF POS=(13,01),LENGTH=10,ATTRB=PROT,                       X00680004
               COLOR=TURQUOISE,                                        X00690000
               INITIAL='CURSO....:'                                     00700000
                                                                        00710000
TCURS   DFHMDF POS=(13,12),LENGTH=20,ATTRB=PROT,                       X00720006
               COLOR=GREEN,                                            X00730006
               INITIAL=' '                                              00740006
        DFHMDF POS=(13,33),ATTRB=ASKIP                                  00750006
*---------------------------------------------------------------------  00760006
        DFHMDF POS=(13,47),LENGTH=10,ATTRB=PROT,                       X00770006
               COLOR=TURQUOISE,                                        X00780006
               INITIAL='TURMA....:'                                     00790006
                                                                        00800006
TTURM   DFHMDF POS=(13,58),LENGTH=15,ATTRB=PROT,                       X00810006
               COLOR=GREEN,                                            X00820006
               INITIAL=' '                                              00830006
        DFHMDF POS=(13,74),ATTRB=ASKIP                                  00840006
*---------------------------------------------------------------------  00850006
        DFHMDF POS=(15,01),LENGTH=10,ATTRB=PROT,                       X00860004
               COLOR=TURQUOISE,                                        X00870000
               INITIAL='ENDERECO.:'                                     00880000
                                                                        00890000
TENDR   DFHMDF POS=(15,12),LENGTH=30,ATTRB=PROT,                       X00900006
               COLOR=GREEN,                                            X00910006
               INITIAL=' '                                              00920006
        DFHMDF POS=(15,43),ATTRB=ASKIP                                  00930006
*---------------------------------------------------------------------  00940006
        DFHMDF POS=(15,47),LENGTH=10,ATTRB=PROT,                       X00950006
               COLOR=TURQUOISE,                                        X00960006
               INITIAL='BAIRRO...:'                                     00970006
                                                                        00980006
TBAIR   DFHMDF POS=(15,58),LENGTH=20,ATTRB=PROT,                       X00990006
               COLOR=GREEN,                                            X01000006
               INITIAL=' '                                              01010006
        DFHMDF POS=(15,79),ATTRB=ASKIP                                  01020006
*---------------------------------------------------------------------  01030006
        DFHMDF POS=(17,01),LENGTH=10,ATTRB=PROT,                       X01040004
               COLOR=TURQUOISE,                                        X01050000
               INITIAL='CIDADE...:'                                     01060000
                                                                        01070000
TCIDA   DFHMDF POS=(17,12),LENGTH=25,ATTRB=PROT,                       X01080006
               COLOR=GREEN,                                            X01090006
               INITIAL=' '                                              01100006
        DFHMDF POS=(17,38),ATTRB=ASKIP                                  01110006
*---------------------------------------------------------------------  01120006
        DFHMDF POS=(17,47),LENGTH=10,ATTRB=PROT,                       X01130006
               COLOR=TURQUOISE,                                        X01140006
               INITIAL='ESTADO...:'                                     01150006
                                                                        01160006
TESTD   DFHMDF POS=(17,58),LENGTH=02,ATTRB=PROT,                       X01170006
               COLOR=GREEN,                                            X01180006
               INITIAL=' '                                              01190006
        DFHMDF POS=(17,61),ATTRB=ASKIP                                  01200006
*---------------------------------------------------------------------  01210006
        DFHMDF POS=(19,01),LENGTH=10,ATTRB=PROT,                       X01220004
               COLOR=TURQUOISE,                                        X01230000
               INITIAL='E-MAIL...:'                                     01240000
                                                                        01250000
TMAIL   DFHMDF POS=(19,12),LENGTH=30,ATTRB=PROT,                       X01260006
               COLOR=GREEN,                                            X01270006
               INITIAL=' '                                              01280006
        DFHMDF POS=(19,43),ATTRB=ASKIP                                  01290006
*---------------------------------------------------------------------  01300006
        DFHMDF POS=(19,47),LENGTH=10,ATTRB=PROT,                       X01310004
               COLOR=TURQUOISE,                                        X01320000
               INITIAL='TELEFONE.:'                                     01330000
                                                                        01340006
TFONE   DFHMDF POS=(19,58),LENGTH=15,ATTRB=PROT,                       X01350004
               COLOR=GREEN,                                            X01360000
               INITIAL=' '                                              01370000
        DFHMDF POS=(19,74),ATTRB=ASKIP                                  01380004
*---------------------------------------------------------------------  01390006
        DFHMDF POS=(23,01),LENGTH=11,ATTRB=PROT,                       X01400000
               COLOR=YELLOW,                                           X01410000
               INITIAL='MENSAGEM ->'                                    01420000
*=====================================================================  01430006
MSGDB2O DFHMDI SIZE=(01,67),LINE=23,COLUMN=13                           01440000
*---------------------------------------------------------------------  01450006
TMSGM   DFHMDF POS=(01,01),LENGTH=60,ATTRB=PROT,                       X01460000
               COLOR=RED,                                              X01470000
               INITIAL=' '                                              01480000
                                                                        01490000
TPCUR   DFHMDF POS=(01,66),LENGTH=01,ATTRB=PROT,                       X01500005
               INITIAL=' '                                              01510000
*=====================================================================  01520006
RSPDB2O DFHMDI SIZE=(01,67),LINE=23,COLUMN=13                           01530000
*---------------------------------------------------------------------  01540006
        DFHMDF POS=(01,01),LENGTH=10,ATTRB=PROT,                       X01550000
               COLOR=RED,                                              X01560000
               INITIAL='CONFIRMA A'                                     01570000
                                                                        01580000
TOPR2   DFHMDF POS=(01,12),LENGTH=09,ATTRB=PROT,                       X01590000
               COLOR=RED,                                              X01600000
               INITIAL=' '                                              01610000
                                                                        01620000
        DFHMDF POS=(01,22),LENGTH=06,ATTRB=PROT,                       X01630001
               COLOR=RED,                                              X01640000
               INITIAL='(S/N)?'                                         01650002
                                                                        01660000
TRESP   DFHMDF POS=(01,29),LENGTH=01,ATTRB=(UNPROT,IC),                X01670000
               COLOR=RED,                                              X01680000
               INITIAL=' '                                              01690000
        DFHMDF POS=(01,31),ATTRB=ASKIP                                  01700001
*=====================================================================  01710006
        DFHMSD TYPE=FINAL                                               01720000
               END                                                      01730000
