MAPDB2M DFHMSD TYPE=MAP,                                               X00010000
               TIOAPFX=YES,                                            X00020000
               MODE=INOUT,                                             X00030000
               CTRL=(FREEKB,FRSET),                                    X00040000
               MAPATTS=COLOR,                                          X00050000
               LANG=COBOL                                               00060000
*---------------------------------------------------------------------- 00070000
MAPDB2M DFHMDI SIZE=(24,80),LINE=01,COLUMN=01                           00080005
*-------------                                                          00090000
        DFHMDF POS=(02,01),LENGTH=05,ATTRB=PROT,                       X00100003
               COLOR=YELLOW,                                           X00110000
               INITIAL='DATA:'                                          00120000
                                                                        00130000
TDATA   DFHMDF POS=(02,07),LENGTH=08,ATTRB=PROT,                       X00140003
               COLOR=YELLOW                                             00150000
*-------------                                                          00160000
        DFHMDF POS=(02,22),LENGTH=40,ATTRB=PROT,                       X00170000
               COLOR=YELLOW,                                           X00180000
               INITIAL='FUTURE SCHOOL - CADASTRO DE ALUNOS (DB2)'       00190000
*-------------                                                          00200000
        DFHMDF POS=(02,68),LENGTH=05,ATTRB=PROT,                       X00210005
               COLOR=YELLOW,                                           X00220000
               INITIAL='HORA:'                                          00230000
                                                                        00240000
THORA   DFHMDF POS=(02,74),LENGTH=05,ATTRB=PROT,                       X00250005
               COLOR=YELLOW                                             00260000
*-------------                                                          00270000
        DFHMDF POS=(04,01),LENGTH=06,ATTRB=PROT,                       X00280003
               COLOR=YELLOW,                                           X00290000
               INITIAL='TRANS:'                                         00300000
                                                                        00310000
TTRNS   DFHMDF POS=(04,08),LENGTH=04,ATTRB=PROT,                       X00320003
               COLOR=YELLOW                                             00330000
*-------------                                                          00340000
        DFHMDF POS=(04,31),LENGTH=18,ATTRB=PROT,                       X00350003
               COLOR=TURQUOISE,                                        X00360000
               INITIAL='> MENU PRINCIPAL <'                             00370000
*-------------                                                          00380000
        DFHMDF POS=(04,68),LENGTH=05,ATTRB=PROT,                       X00390005
               COLOR=YELLOW,                                           X00400000
               INITIAL='TERM:'                                          00410000
                                                                        00420000
TTERM   DFHMDF POS=(04,74),LENGTH=05,ATTRB=PROT,                       X00430005
               COLOR=YELLOW                                             00440000
*-------------                                                          00450000
        DFHMDF POS=(08,33),LENGTH=12,ATTRB=PROT,                       X00460003
               COLOR=GREEN,                                            X00470000
               INITIAL='1 - INCLUSAO'                                   00480000
                                                                        00490000
        DFHMDF POS=(10,33),LENGTH=12,ATTRB=PROT,                       X00500003
               COLOR=GREEN,                                            X00510000
               INITIAL='2 - CONSULTA'                                   00520000
                                                                        00530000
        DFHMDF POS=(12,33),LENGTH=13,ATTRB=PROT,                       X00540003
               COLOR=GREEN,                                            X00550000
               INITIAL='3 - ALTERACAO'                                  00560000
                                                                        00570000
        DFHMDF POS=(14,33),LENGTH=12,ATTRB=PROT,                       X00580003
               COLOR=GREEN,                                            X00590000
               INITIAL='4 - EXCLUSAO'                                   00600000
                                                                        00610000
        DFHMDF POS=(16,33),LENGTH=13,ATTRB=PROT,                       X00620003
               COLOR=GREEN,                                            X00630000
               INITIAL='5 - RELATORIO'                                  00640000
                                                                        00650000
        DFHMDF POS=(18,33),LENGTH=12,ATTRB=PROT,                       X00660003
               COLOR=GREEN,                                            X00670000
               INITIAL='6 - FINALIZA'                                   00680000
*-------------                                                          00690000
        DFHMDF POS=(23,01),LENGTH=11,ATTRB=PROT,                       X00700003
               COLOR=YELLOW,                                           X00710001
               INITIAL='MENSAGEM ->'                                    00720000
                                                                        00730000
        DFHMDF POS=(23,76),LENGTH=03,ATTRB=PROT,                       X00740003
               COLOR=YELLOW,                                           X00750001
               INITIAL='ABS'                                            00760000
*---------------------------------------------------------------------- 00770000
MSGDB2M DFHMDI SIZE=(01,62),LINE=23,COLUMN=13                           00780005
*-------------                                                          00790000
        DFHMDF POS=(01,01),LENGTH=37,ATTRB=PROT,                       X00800000
               COLOR=RED,                                              X00810001
               INITIAL='INFORME O NUMERO DA OPCAO DESEJADA ->'          00820000
                                                                        00830000
TNOPC   DFHMDF POS=(01,39),LENGTH=01,ATTRB=(UNPROT,IC),                X00840000
               COLOR=RED,                                              X00850005
               INITIAL='0'                                              00860000
                                                                        00870000
        DFHMDF POS=(01,41),ATTRB=ASKIP                                  00880000
*---------------------------------------------------------------------  00890000
ERRDB2M DFHMDI SIZE=(01,62),LINE=23,COLUMN=13                           00900005
*-------------                                                          00910000
        DFHMDF POS=(01,01),LENGTH=15,ATTRB=PROT,                       X00920000
               COLOR=RED,                                              X00930000
               INITIAL='OPCAO INVALIDA,'                                00940000
                                                                        00950000
        DFHMDF POS=(01,17),LENGTH=32,ATTRB=PROT,                       X00960000
               COLOR=RED,                                              X00970000
               INITIAL='INFORME APENAS NUMEROS DE 1 A 6!'               00980000
                                                                        00990000
TPCUR   DFHMDF POS=(01,60),LENGTH=01,ATTRB=PROT,                       X01000005
               INITIAL=' '                                              01010000
*---------------------------------------------------------------------  01020000
        DFHMSD TYPE=FINAL                                               01030000
               END                                                      01040000
