MAPDB2O DFHMSD TYPE=MAP,                                               X00010000
               TIOAPFX=YES,                                            X00020000
               MODE=INOUT,                                             X00030000
               CTRL=(FREEKB,FRSET),                                    X00040000
               MAPATTS=COLOR,                                          X00050000
               LANG=COBOL                                               00060000
                                                                        00070000
MAPDB2O DFHMDI SIZE=(24,80),LINE=1,COLUMN=1                             00080000
*---------------------------------------------------------------------- 00090000
        DFHMDF POS=(02,02),LENGTH=05,ATTRB=PROT,                       X00100000
               COLOR=YELLOW,                                           X00110000
               INITIAL='DATA:'                                          00120000
                                                                        00130000
TDATA   DFHMDF POS=(02,08),LENGTH=10,ATTRB=PROT,                       X00140000
               COLOR=YELLOW                                             00150000
*---------------------------------------------------------------------- 00160000
        DFHMDF POS=(02,21),LENGTH=40,ATTRB=PROT,                       X00170000
               COLOR=YELLOW,                                           X00180000
               INITIAL='FUTURE SCHOOL - CADASTRO DE ALUNOS (ABS)'       00190000
*---------------------------------------------------------------------- 00200000
        DFHMDF POS=(02,65),LENGTH=05,ATTRB=PROT,                       X00210000
               COLOR=YELLOW,                                           X00220000
               INITIAL='HORA:'                                          00230000
                                                                        00240000
THORA   DFHMDF POS=(02,71),LENGTH=08,ATTRB=PROT,                       X00250000
               COLOR=YELLOW                                             00260000
*---------------------------------------------------------------------- 00270000
        DFHMDF POS=(04,02),LENGTH=06,ATTRB=PROT,                       X00280000
               COLOR=YELLOW,                                           X00290000
               INITIAL='TRANS:'                                         00300000
                                                                        00310000
TTRNS   DFHMDF POS=(04,09),LENGTH=10,ATTRB=PROT,                       X00320000
               COLOR=YELLOW                                             00330000
*---------------------------------------------------------------------- 00340000
        DFHMDF POS=(04,30),LENGTH=09,ATTRB=PROT,                       X00350000
               COLOR=TURQUOISE,                                        X00360000
               INITIAL='OPERACAO:'                                      00370000
                                                                        00380000
TOPER   DFHMDF POS=(04,40),LENGTH=09,ATTRB=PROT,                       X00390000
               COLOR=GREEN,                                            X00391000
               INITIAL='         '                                      00400000
*---------------------------------------------------------------------- 00410000
        DFHMDF POS=(04,65),LENGTH=05,ATTRB=PROT,                       X00420000
               COLOR=YELLOW,                                           X00430000
               INITIAL='TERM:'                                          00440000
                                                                        00450000
TTERM   DFHMDF POS=(04,71),LENGTH=08,ATTRB=PROT,                       X00460000
               COLOR=YELLOW                                             00470000
*---------------------------------------------------------------------- 00480000
        DFHMDF POS=(08,02),LENGTH=10,ATTRB=PROT,                       X00490000
               COLOR=TURQUOISE,                                        X00500000
               INITIAL='MATRICULA:'                                     00510000
                                                                        00520000
TMTRC   DFHMDF POS=(08,13),LENGTH=05,ATTRB=(UNPROT,IC),                X00530000
               COLOR=GREEN,                                            X00540000
               INITIAL='00000'                                          00550000
                                                                        00560000
        DFHMDF POS=(08,19),ATTRB=ASKIP                                  00570000
*---------------------------------------------------------------------- 00580000
        DFHMDF POS=(10,02),LENGTH=10,ATTRB=PROT,                       X00590000
               COLOR=TURQUOISE,                                        X00600000
               INITIAL='NOME.....:'                                     00610000
                                                                        00620000
TNOME   DFHMDF POS=(10,13),LENGTH=30,ATTRB=PROT,                       X00630000
               COLOR=GREEN,                                            X00640000
               INITIAL='                              '                 00650000
                                                                        00660000
        DFHMDF POS=(10,44),ATTRB=ASKIP                                  00670000
*---------------------------------------------------------------------- 00680000
        DFHMDF POS=(12,02),LENGTH=10,ATTRB=PROT,                       X00690000
               COLOR=TURQUOISE,                                        X00700000
               INITIAL='CURSO....:'                                     00710000
                                                                        00720000
TCURS   DFHMDF POS=(12,13),LENGTH=20,ATTRB=PROT,                       X00730001
               COLOR=GREEN,                                            X00740000
               INITIAL='                    '                           00750001
                                                                        00760000
        DFHMDF POS=(12,39),ATTRB=ASKIP                                  00770002
*---------------------------------------------------------------------- 00780000
        DFHMDF POS=(14,02),LENGTH=10,ATTRB=PROT,                       X00790000
               COLOR=TURQUOISE,                                        X00800000
               INITIAL='TELEFONE.:'                                     00810000
                                                                        00820000
TFONE   DFHMDF POS=(14,13),LENGTH=15,ATTRB=PROT,                       X00830000
               COLOR=GREEN,                                            X00840000
               INITIAL='                              '                 00850000
                                                                        00860000
        DFHMDF POS=(14,29),ATTRB=ASKIP                                  00870000
*---------------------------------------------------------------------- 00880000
        DFHMDF POS=(16,02),LENGTH=10,ATTRB=PROT,                       X00890000
               COLOR=TURQUOISE,                                        X00900000
               INITIAL='ENDERECO.:'                                     00910000
                                                                        00920000
TENDR   DFHMDF POS=(16,13),LENGTH=35,ATTRB=PROT,                       X00930001
               COLOR=GREEN,                                            X00940000
               INITIAL='                                   '            00950001
                                                                        00960000
        DFHMDF POS=(16,49),ATTRB=ASKIP                                  00970002
*---------------------------------------------------------------------- 00980000
        DFHMDF POS=(18,02),LENGTH=10,ATTRB=PROT,                       X00990000
               COLOR=TURQUOISE,                                        X01000000
               INITIAL='EMAIL....:'                                     01010000
                                                                        01020000
TMAIL   DFHMDF POS=(18,13),LENGTH=30,ATTRB=PROT,                       X01030000
               COLOR=GREEN,                                            X01040000
               INITIAL='                              '                 01050001
                                                                        01060000
        DFHMDF POS=(18,44),ATTRB=ASKIP                                  01070000
*---------------------------------------------------------------------- 01080000
TCONF   DFHMDF POS=(21,13),LENGTH=27,ATTRB=PROT,                       X01090000
               COLOR=TURQUOISE,                                        X01100000
               INITIAL='                           '                    01110000
                                                                        01120000
TRESP   DFHMDF POS=(21,41),LENGTH=01,ATTRB=PROT,                       X01130000
               COLOR=TURQUOISE,                                        X01140000
               INITIAL=' '                                              01150000
                                                                        01160000
        DFHMDF POS=(21,43),ATTRB=ASKIP                                  01170000
*---------------------------------------------------------------------- 01180000
        DFHMDF POS=(23,13),LENGTH=11,ATTRB=PROT,                       X01190000
               COLOR=RED,                                              X01200000
               INITIAL='MENSAGEM ->'                                    01210000
                                                                        01220000
TMSGM   DFHMDF POS=(23,25),LENGTH=35,ATTRB=PROT,                       X01230000
               COLOR=RED,                                              X01240000
               INITIAL='                                   '            01250000
                                                                        01251000
TPCUR   DFHMDF POS=(23,61),LENGTH=01,ATTRB=PROT,                       X01252000
               INITIAL=' '                                              01253000
*---------------------------------------------------------------------- 01260000
        DFHMSD TYPE=FINAL                                               01270000
               END                                                      01280000
