MAPDB2C DFHMSD TYPE=MAP,MODE=INOUT,CTRL=(FREEKB,FRSET),                X
               TIOAPFX=YES,MAPATTS=COLOR,LANG=COBOL
*=====================================================================
MAPDB2C DFHMDI SIZE=(24,80),LINE=01,COLUMN=01
*
        DFHMDF POS=(02,01),LENGTH=05,COLOR=YELLOW,INITIAL='DATA:'
TDATA   DFHMDF POS=(02,07),LENGTH=08,COLOR=YELLOW
        DFHMDF POS=(02,22),LENGTH=40,COLOR=YELLOW,                     X
               INITIAL='FUTURE SCHOOL - CADASTRO DE ALUNOS (DB2)'
        DFHMDF POS=(02,68),LENGTH=05,COLOR=YELLOW,INITIAL='HORA:'
THORA   DFHMDF POS=(02,74),LENGTH=05,COLOR=YELLOW
        DFHMDF POS=(04,01),LENGTH=06,COLOR=YELLOW,INITIAL='TRANS:'
TTRNS   DFHMDF POS=(04,08),LENGTH=04,COLOR=YELLOW
*
        DFHMDF POS=(04,29),LENGTH=11,COLOR=TURQUOISE,                  X
               INITIAL='OPERACAO ->'
TOPR1   DFHMDF POS=(04,41),LENGTH=09,COLOR=GREEN
        DFHMDF POS=(04,68),LENGTH=05,COLOR=YELLOW,INITIAL='TERM:'
TTERM   DFHMDF POS=(04,74),LENGTH=05,COLOR=YELLOW
*---------------------------------------------------------------------
        DFHMDF POS=(08,01),LENGTH=10,COLOR=TURQUOISE,                  X
               INITIAL='MATRICULA:'
TMTRC   DFHMDF POS=(08,12),LENGTH=05,ATTRB=(UNPROT,IC),COLOR=GREEN,    X
               INITIAL='00000'
        DFHMDF POS=(08,18),ATTRB=ASKIP
*
        DFHMDF POS=(11,01),LENGTH=10,COLOR=TURQUOISE,                  X
               INITIAL='NOME.....:'
TNOME   DFHMDF POS=(11,12),LENGTH=30,COLOR=GREEN
        DFHMDF POS=(11,43),ATTRB=ASKIP
*
        DFHMDF POS=(13,01),LENGTH=10,COLOR=TURQUOISE,                  X
               INITIAL='CURSO....:'
TCURS   DFHMDF POS=(13,12),LENGTH=20,COLOR=GREEN
        DFHMDF POS=(13,33),ATTRB=ASKIP
*
        DFHMDF POS=(13,47),LENGTH=10,COLOR=TURQUOISE,                  X
               INITIAL='TURMA....:'
TTURM   DFHMDF POS=(13,58),LENGTH=15,COLOR=GREEN
        DFHMDF POS=(13,74),ATTRB=ASKIP
*
        DFHMDF POS=(15,01),LENGTH=10,COLOR=TURQUOISE,                  X
               INITIAL='ENDERECO.:'
TENDR   DFHMDF POS=(15,12),LENGTH=30,COLOR=GREEN
        DFHMDF POS=(15,43),ATTRB=ASKIP
*
        DFHMDF POS=(15,47),LENGTH=10,COLOR=TURQUOISE,                  X
               INITIAL='BAIRRO...:'
TBAIR   DFHMDF POS=(15,58),LENGTH=20,COLOR=GREEN
        DFHMDF POS=(15,79),ATTRB=ASKIP
*
        DFHMDF POS=(17,01),LENGTH=10,COLOR=TURQUOISE,                  X
               INITIAL='CIDADE...:'
TCIDA   DFHMDF POS=(17,12),LENGTH=25,COLOR=GREEN
        DFHMDF POS=(17,38),ATTRB=ASKIP
*
        DFHMDF POS=(17,47),LENGTH=10,COLOR=TURQUOISE,                  X
               INITIAL='ESTADO...:'
TESTD   DFHMDF POS=(17,58),LENGTH=02,COLOR=GREEN
        DFHMDF POS=(17,61),ATTRB=ASKIP
*
        DFHMDF POS=(19,01),LENGTH=10,COLOR=TURQUOISE,                  X
               INITIAL='E-MAIL...:'
TMAIL   DFHMDF POS=(19,12),LENGTH=30,COLOR=GREEN
        DFHMDF POS=(19,43),ATTRB=ASKIP
*
        DFHMDF POS=(19,47),LENGTH=10,COLOR=TURQUOISE,                  X
               INITIAL='TELEFONE.:'
TFONE   DFHMDF POS=(19,58),LENGTH=15,COLOR=GREEN
        DFHMDF POS=(19,74),ATTRB=ASKIP
*
        DFHMDF POS=(23,01),LENGTH=11,COLOR=YELLOW,                     X
               INITIAL='MENSAGEM ->'
TMSGM   DFHMDF POS=(23,13),LENGTH=60,COLOR=RED
TPCSR   DFHMDF POS=(23,78),LENGTH=01,ATTRB=PROT,INITIAL=' '
*=====================================================================
RSPDB2C DFHMDI SIZE=(01,67),LINE=23,COLUMN=13
*
        DFHMDF POS=(01,01),LENGTH=10,COLOR=RED,INITIAL='CONFIRMA A'
TOPR2   DFHMDF POS=(01,12),LENGTH=09,COLOR=RED
        DFHMDF POS=(01,22),LENGTH=06,COLOR=RED,INITIAL='(S/N)?'
TRESP   DFHMDF POS=(01,29),LENGTH=01,ATTRB=(UNPROT,IC),COLOR=RED
        DFHMDF POS=(01,31),ATTRB=ASKIP
*=====================================================================
        DFHMSD TYPE=FINAL
               END
