       IDENTIFICATION   DIVISION.
       PROGRAM-ID.      PIDB22XX.
       AUTHOR.          FATIMA DINIZ
      *
      *  GERA PROGRAMA DE INCLUSAO
      *

       ENVIRONMENT      DIVISION.
       CONFIGURATION    SECTION.
       SPECIAL-NAMES.
                        DECIMAL-POINT IS COMMA.

      *===========================================================   ==*
       DATA             DIVISION.
       WORKING-STORAGE  SECTION.
      *================================================================*

       77 WS-DATA         PIC  X(10)         VALUE SPACES.
       77 WS-HORA         PIC  X(05)         VALUE SPACES.
       77 WS-TIME         PIC S9(15)  COMP-3 VALUE ZEROS.
       77 WS-FASE         PIC  9(01)         VALUE ZEROS.
       77 WS-ENCERRA      PIC  X(20)         VALUE 'PROGRAMA ENCERRADO'.

           COPY DFHBMSCA.
      * AREA DO CICS
           COPY DFHAID.
      * CONTEM OS VALORES DAS TECLAS DE FUNCAO
           COPY MGDB22X.
      * MAPA
           EXEC SQL INCLUDE SQLCA
           END-EXEC.
      *AREA DO DB2 EX: SQLCODE
           EXEC SQL INCLUDE CADDB2
           END-EXEC.
      *COPIA DA DCLGEN PARA DENTRO DO PROGRAMA

      *================================================================*
       LINKAGE SECTION.
      *================================================================*
       01  DFHCOMMAREA.
           03 LK-FASE    PIC   9(01).

      *================================================================*
       PROCEDURE DIVISION.
      *================================================================*
       000-00-INICIO SECTION.
           IF  EIBCALEN = 0
              PERFORM 001-00-FORMATA-TELA
              MOVE DFHBMPRF TO TNOMEA
              MOVE DFHBMPRF TO TCURSOA
              MOVE DFHBMPRF TO TMENSAA
              MOVE SPACES      TO TNOMEO
              MOVE SPACES      TO TCURSOO
              MOVE SPACES      TO TTURMAO
              MOVE SPACES      TO TENDO
              MOVE SPACES      TO TBAIRROO
              MOVE SPACES      TO TCIDADEO
              MOVE SPACES      TO TESTADOO
              MOVE SPACES      TO TTELEFO
              MOVE SPACES      TO TEMAILO
              MOVE DFHBMPRF    TO TNOMEA
              MOVE DFHBMPRF    TO TCURSOA
              MOVE DFHBMPRF    TO TTURMAA
              MOVE DFHBMPRF    TO TENDA
              MOVE DFHBMPRF    TO TBAIRROA
              MOVE DFHBMPRF    TO TCIDADEA
              MOVE DFHBMPRF    TO TESTADOA
              MOVE DFHBMPRF    TO TTELEFA
              MOVE DFHBMPRF    TO TEMAILA
              MOVE DFHBMPRF    TO TCONFA
              MOVE DFHBMPRF    TO TCONFDA
              MOVE DFHBMFSE    TO TMATRICA
              MOVE ZEROS       TO TMATRICO
              MOVE DFHBMPRF                       TO TMENSAA
              MOVE 'DIGITE A OPCAO E TECLE ENTER' TO TMENSAO
      *       MOVE DFHBMFSE                       TO TOPCAOA
              MOVE  -1                            TO TMATRICL
              MOVE  1                             TO WS-FASE
              MOVE SPACES                         TO TNOMEO
              PERFORM 002-00-MOSTRA-TELA
              PERFORM 999-00-ENCERRA
           ELSE
              PERFORM 003-00-RECEBE-TELA
              PERFORM 004-00-VALIDA-FASE
           END-IF.

       001-00-FORMATA-TELA  SECTION.
           EXEC CICS
                ASKTIME ABSTIME (WS-TIME)
           END-EXEC.

           EXEC CICS
                FORMATTIME ABSTIME (WS-TIME)
                DATESEP('/') TIMESEP(':')
                DDMMYYYY(WS-DATA)
                TIME(WS-HORA)
           END-EXEC.

           MOVE DFHBMPRF TO THORAA
           MOVE WS-HORA  TO THORAO

           MOVE DFHBMPRF TO TDATAA
           MOVE WS-DATA  TO TDATAO

           MOVE DFHBMPRF TO TTRANSA.
           MOVE EIBTRNID TO TTRANSO.

           MOVE DFHBMPRF TO TTERMA.
           MOVE EIBTRMID TO TTERMO.

       001-00-FIM. EXIT.

       002-00-MOSTRA-TELA  SECTION.

      *    CURSOR -> PARA POSICIONAR O CURSOR
      *    NOHANDLE ->PARA NAO ABENDAR E EU TRATAR O ERRO

           EXEC CICS

                SEND MAP('MGDB22X')
                     MAPSET('MGDB22X')
                     FROM(MGDB22XI)
                     NOHANDLE
                     CURSOR
                     ERASE
           END-EXEC.
       003-00-RECEBE-TELA SECTION.
               EXEC CICS
                   RECEIVE MAP('MGDB22X')
                   MAPSET('MGDB22X')
                   INTO(MGDB22XI)
                   NOHANDLE
               END-EXEC
               IF EIBAID EQUAL DFHPF3
                  EXEC CICS XCTL PROGRAM('PMDB22XX')
                  END-EXEC
               END-IF.
       004-00-VALIDA-FASE      SECTION.

           MOVE LK-FASE  TO WS-FASE
           EVALUATE WS-FASE
                WHEN 1
                   PERFORM 005-00-VERIFICAR-MATRICULA
                WHEN 2
                   PERFORM 006-00-VALIDA-CAMPOS
                WHEN 3
                   PERFORM 007-00-CONFIRMA
                WHEN 4
                   EXEC CICS XCTL PROGRAM('PIDB22XX')
                   END-EXEC
                END-EVALUATE.
       005-00-VERIFICAR-MATRICULA  SECTION.
           IF TMATRICI IS NOT NUMERIC
              MOVE 'MATRICULA INVALIDA' TO TMENSAO
              MOVE 1 TO WS-FASE
              PERFORM 001-00-FORMATA-TELA
              PERFORM 002-00-MOSTRA-TELA
              PERFORM 999-00-ENCERRA
            END-IF.
            MOVE TMATRICI      TO CAD-MATRIC

            EXEC SQL
                 SELECT CAD_MATRIC,
                        CAD_NOME,
                        CAD_CURSO,
                        CAD_TURMA,
                        CAD_END,
                        CAD_BAIRRO,
                        CAD_CIDADE,
                        CAD_ESTADO,
                        CAD_TELEF,
                        CAD_EMAIL

                  INTO :CAD-MATRIC,
                       :CAD-NOME,
                       :CAD-CURSO,
                       :CAD-TURMA,
                       :CAD-END,
                       :CAD-BAIRRO,
                       :CAD-CIDADE,
                       :CAD-ESTADO,
                       :CAD-TELEF,
                       :CAD-EMAIL
      *OS : INDICA UMA VARIAVEL HOST-Q ESTOU INDO BUSCAR NO COBOL

                 FROM DBADB2.TBCADDB22

                 WHERE CAD_MATRIC = :CAD-MATRIC

            END-EXEC.

            IF SQLCODE = 0
               MOVE 'MATRICULA EXISTENTE' TO TMENSAO
               MOVE CAD-NOME              TO TNOMEO
               MOVE CAD-CURSO             TO TCURSOO
               MOVE CAD-TURMA             TO TTURMAO
               MOVE CAD-END               TO TENDO
               MOVE CAD-BAIRRO            TO TBAIRROO
               MOVE CAD-CIDADE            TO TCIDADEO
               MOVE CAD-ESTADO            TO TESTADOO
               MOVE CAD-TELEF             TO TTELEFO
               MOVE CAD-EMAIL             TO TEMAILO
               PERFORM 001-00-FORMATA-TELA
               MOVE  -1                   TO TMATRICL
               PERFORM 002-00-MOSTRA-TELA
               PERFORM 999-00-ENCERRA
             END-IF.
             MOVE DFHBMPRF     TO TMATRICA
             MOVE DFHBMFSE     TO TNOMEA
             MOVE DFHBMFSE     TO TTURMAA
             MOVE DFHBMFSE     TO TCURSOA
             MOVE DFHBMFSE     TO TENDA
             MOVE DFHBMFSE     TO TBAIRROA
             MOVE DFHBMFSE     TO TCIDADEA
             MOVE DFHBMFSE     TO TESTADOA
             MOVE DFHBMFSE     TO TTELEFA
             MOVE DFHBMFSE     TO TEMAILA
             MOVE -1           TO TNOMEL
             MOVE 2            TO WS-FASE
             PERFORM 001-00-FORMATA-TELA
             PERFORM 002-00-MOSTRA-TELA
             PERFORM 999-00-ENCERRA.

       006-00-VALIDA-CAMPOS   SECTION.
             MOVE DFHBMPRF     TO TMATRICA
             MOVE DFHBMPRF     TO TNOMEA
             MOVE DFHBMPRF     TO TTURMAA
             MOVE DFHBMPRF     TO TCURSOA
             MOVE DFHBMPRF     TO TENDA
             MOVE DFHBMPRF     TO TBAIRROA
             MOVE DFHBMPRF     TO TCIDADEA
             MOVE DFHBMPRF     TO TESTADOA
             MOVE DFHBMPRF     TO TTELEFA
             MOVE DFHBMPRF     TO TEMAILA
             IF TNOMEI = SPACES
                MOVE 'NOME INVALIDO' TO TMENSAO
                MOVE 2               TO WS-FASE
                MOVE -1              TO TNOMEL
                MOVE DFHBMFSE        TO TNOMEA
                PERFORM 001-00-FORMATA-TELA
                PERFORM 002-00-MOSTRA-TELA
                PERFORM 999-00-ENCERRA
             END-IF.
             IF TCURSOI = SPACES
                MOVE 'CURSO INVALIDO'    TO  TMENSAO
                MOVE 2  TO WS-FASE
                MOVE -1 TO TCURSOL
                MOVE DFHBMFSE   TO TCURSOA
                PERFORM 001-00-FORMATA-TELA
                PERFORM 002-00-MOSTRA-TELA
                PERFORM 999-00-ENCERRA
           END-IF.
           IF TTURMAI  = SPACES
              MOVE 'TURMA INVALIDA'    TO  TMENSAO
              MOVE 2  TO WS-FASE
              MOVE -1 TO TTURMAL
              MOVE DFHBMFSE   TO TTURMAA
              PERFORM 001-00-FORMATA-TELA
              PERFORM 002-00-MOSTRA-TELA
              PERFORM 999-00-ENCERRA
           END-IF.
           IF TENDI   = SPACES
              MOVE 'ENDERECO INVALIDO' TO  TMENSAO
              MOVE 2 TO WS-FASE
              MOVE -1 TO TENDL
              MOVE DFHBMFSE  TO TENDA
              PERFORM 001-00-FORMATA-TELA
              PERFORM 002-00-MOSTRA-TELA
              PERFORM 999-00-ENCERRA
           END-IF.
           IF TBAIRROI = SPACES
              MOVE 'BAIRRO INEXISTENTE' TO    TMENSAO
              MOVE 2 TO WS-FASE
              MOVE -1 TO TBAIRROL
              MOVE DFHBMFSE  TO TBAIRROA
              PERFORM 001-00-FORMATA-TELA
              PERFORM 002-00-MOSTRA-TELA
              PERFORM 999-00-ENCERRA
           END-IF.
           IF TCIDADEI = SPACES
              MOVE 'CIDADE INVALIDA' TO  TMENSAO
              MOVE 2 TO WS-FASE
              MOVE -1 TO TCIDADEL
              MOVE DFHBMFSE  TO TCIDADEA
              PERFORM 001-00-FORMATA-TELA
              PERFORM 002-00-MOSTRA-TELA
              PERFORM 999-00-ENCERRA
           END-IF.
           IF TESTADOI = SPACES
              MOVE 'ESTADO INVALIDO'  TO  TMENSAO
              MOVE 2 TO WS-FASE
              MOVE -1 TO TESTADOL
              MOVE DFHBMFSE  TO TESTADOA
              PERFORM 001-00-FORMATA-TELA
              PERFORM 002-00-MOSTRA-TELA
              PERFORM 999-00-ENCERRA
           END-IF.
           IF TTELEFI =  SPACES
              MOVE 'TELEFONE INVALIDO' TO  TMENSAO
              MOVE 2 TO WS-FASE
              MOVE -1 TO TTELEFL
              MOVE DFHBMFSE  TO TTELEFA
              PERFORM 001-00-FORMATA-TELA
              PERFORM 002-00-MOSTRA-TELA
              PERFORM 999-00-ENCERRA
           END-IF.
           IF TEMAILI =  SPACES
              MOVE 'EMAIL INVALIDO'   TO  TMENSAO
              MOVE 2                  TO WS-FASE
              MOVE -1                 TO TEMAILL
              MOVE DFHBMFSE           TO TEMAILA
              PERFORM 001-00-FORMATA-TELA
              PERFORM 002-00-MOSTRA-TELA
              PERFORM 999-00-ENCERRA
           END-IF.
           MOVE DFHBMFSE              TO TCONFA
           MOVE -1                    TO TCONFL
           MOVE 'CONFIRMA ?'          TO TCONFDO
           MOVE 3                     TO WS-FASE
           MOVE 'S'                   TO TCONFO
           PERFORM 001-00-FORMATA-TELA
           PERFORM 002-00-MOSTRA-TELA
           PERFORM 999-00-ENCERRA.
       007-00-CONFIRMA    SECTION.
             IF TCONFI = 'S'
                MOVE TMATRICI TO CAD-MATRIC
                MOVE TNOMEI   TO CAD-NOME
                MOVE TCURSOI  TO CAD-CURSO
                MOVE TTURMAI  TO CAD-TURMA
                MOVE TENDI    TO CAD-END
                MOVE TBAIRROI TO CAD-BAIRRO
                MOVE TCIDADEI TO CAD-CIDADE
                MOVE TESTADOI TO CAD-ESTADO
                MOVE TTELEFI  TO CAD-TELEF
                MOVE TEMAILI  TO CAD-EMAIL

                EXEC SQL INSERT INTO DBADB2.TBCADDB22
                      ( CAD_MATRIC,
                        CAD_NOME,
                        CAD_CURSO,
                        CAD_TURMA,
                        CAD_END,
                        CAD_BAIRRO,
                        CAD_CIDADE,
                        CAD_ESTADO,
                        CAD_TELEF,
                        CAD_EMAIL
                       )
                 VALUES( :CAD-MATRIC,
                         :CAD-NOME,
                         :CAD-CURSO,
                         :CAD-TURMA,
                         :CAD-END,
                         :CAD-BAIRRO,
                         :CAD-CIDADE,
                         :CAD-ESTADO,
                         :CAD-TELEF,
                         :CAD-EMAIL
                         )
      *OS : INDICA UMA VARIAVEL HOST-Q ESTOU INDO BUSCAR NO COBOL
               END-EXEC
               MOVE 'REGISTRO INCLUIDO'   TO TMENSAO
               MOVE 4                     TO WS-FASE
               PERFORM 001-00-FORMATA-TELA
               PERFORM 002-00-MOSTRA-TELA
               PERFORM 999-00-ENCERRA
            ELSE
              EXEC CICS XCTL PROGRAM('PIDB22XX')
              END-EXEC
            END-IF.
       999-00-ENCERRA SECTION.
           EXEC CICS RETURN
                TRANSID ('TDBI')
                COMMAREA (WS-FASE)
           END-EXEC.
