       IDENTIFICATION        DIVISION.
       PROGRAM-ID.           PRGDB2R.
       AUTHOR.               ADILSON BIZARRIA.
       INSTALLATION.         FUTURE SCHOOL.
       DATE-WRITTEN.         11/23/2022.
       DATE-COMPILED.
      *--------------------------------------*
      * DB2 - CADASTRO DE ALUNOS (RELATORIO) *
      *--------------------------------------*
       ENVIRONMENT           DIVISION.
       CONFIGURATION         SECTION.

       SOURCE-COMPUTER.      IBM-3090.
       OBJECT-COMPUTER.      IBM-3090.

       SPECIAL-NAMES.
                             DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT          SECTION.

       FILE-CONTROL.

       DATA                  DIVISION.
       FILE                  SECTION.

       WORKING-STORAGE       SECTION.

       77  WS-TIME           PIC S9(15)  COMP-3.
       77  WS-DATA           PIC  X(08).
       77  WS-HORA           PIC  X(05).
       77  WS-LINE           PIC  9(02).

       01  WS-COMM.
           03  WS-PAGE       PIC  9(01).
           03  WS-MATI       PIC  9(05).
           03  WS-MATF       PIC  9(05).

           COPY    DFHAID.
           COPY    DFHBMSCA.
           COPY    MAPDB2R.

           EXEC    SQL       INCLUDE    SQLCA    END-EXEC.
           EXEC    SQL       INCLUDE    DB2ALU   END-EXEC.

       LINKAGE               SECTION.

       01  DFHCOMMAREA.
           03  LK-PAGE       PIC  9(01).
           03  LK-MATI       PIC  9(05).
           03  LK-MATF       PIC  9(05).

       PROCEDURE             DIVISION   USING    DFHCOMMAREA.

           EXEC    SQL       DECLARE    CSR_ASC  CURSOR
                   FOR       SELECT     MAT_ALU,
                                        NOM_ALU, CUR_ALU, TUR_ALU,
                                        END_ALU, BAI_ALU, CID_ALU,
                                        EST_ALU, EML_ALU, TEL_ALU
                             FROM       DBADB2.TABALU
                             WHERE      MAT_ALU  >  :MAT-ALU
                             ORDER  BY  MAT_ALU
           END-EXEC.

           EXEC    SQL       DECLARE    CSR_DSC  CURSOR
                   FOR       SELECT     MAT_ALU,
                                        NOM_ALU, CUR_ALU, TUR_ALU,
                                        END_ALU, BAI_ALU, CID_ALU,
                                        EST_ALU, EML_ALU, TEL_ALU
                             FROM       DBADB2.TABALU
                             WHERE      MAT_ALU  <  :MAT-ALU
                             ORDER  BY  MAT_ALU  DESC
           END-EXEC.

       000-INI-PROG.
           IF  EIBCALEN  =   0
               GO  TO        100-INI-MAPA
           ELSE
               GO  TO        200-REC-TELA
           END-IF.

       100-INI-MAPA.
           MOVE     1         TO   WS-PAGE
           MOVE     ZEROS     TO   WS-MATI  WS-MATF

           MOVE     SPACES    TO   TMAT1O   TMAT2O   TMAT3O
                                   TNOMEO   TCURSO   TTURMO
                                   TENDRO   TBAIRO   TCIDAO
                                   TESTDO   TMAILO   TFONEO.
       110-ATU-DATA.
           EXEC     CICS  ASKTIME
                          ABSTIME (WS-TIME)
           END-EXEC

           EXEC     CICS  FORMATTIME
                          ABSTIME (WS-TIME)
                          DATESEP ('/')
                          DDMMYY  (WS-DATA)
                          TIMESEP (':')
                          TIME    (WS-HORA)
           END-EXEC

           MOVE     WS-DATA   TO   TDATAO
           MOVE     WS-HORA   TO   THORAO
           MOVE     DFHBMPRF  TO   TDATAA    THORAA.

       120-ATU-HEAD.
           MOVE     EIBTRNID  TO   TTRNSO
           MOVE     EIBTRMID  TO   TTERMO
           MOVE     DFHBMPRF  TO   TTRNSA    TTERMA

           EXEC     CICS  SEND     MAP      ('CABDB2R')
                                   MAPSET   ('MAPDB2R')
                          FROM              (CABDB2RO)
                          ACCUM    ERASE
           END-EXEC

           EVALUATE WS-PAGE
              WHEN  1
                    EXEC     CICS  SEND     MAP      ('CB1DB2R')
                                            MAPSET   ('MAPDB2R')
                                   FROM              (CB1DB2RO)
                                   ACCUM    ERASE
                    END-EXEC
              WHEN  2
                    EXEC     CICS  SEND     MAP      ('CB2DB2R')
                                            MAPSET   ('MAPDB2R')
                                   FROM              (CB2DB2RO)
                                   ACCUM    ERASE
                    END-EXEC
              WHEN  3
                    EXEC     CICS  SEND     MAP      ('CB3DB2R')
                                            MAPSET   ('MAPDB2R')
                                   FROM              (CB3DB2RO)
                                   ACCUM    ERASE
                    END-EXEC
           END-EVALUATE.

       130-ATU-LIST.
           MOVE     ZEROS     TO   WS-LINE
           MOVE     WS-MATI   TO   MAT-ALU

           EXEC     SQL   OPEN     CSR_ASC   END-EXEC

           PERFORM  140-LIST-DET   UNTIL     WS-LINE   >   13
                                   OR        SQLCODE  NOT  =  0

           EXEC     SQL   CLOSE    CSR_ASC   END-EXEC

           IF  WS-LINE    =   0
               EXEC     CICS  SEND  CONTROL  ALARM  END-EXEC

               MOVE    'NAO EXISTEM ALUNOS CADASTRADOS!'  TO  TMSGMO
           ELSE
               MOVE    'PF3-MENU, PF7-ACIMA, PF8-ABAIXO, PF10-ESQUERDA,
      -                'PF11-DIREITA'                     TO  TMSGMO
           END-IF

           MOVE     SPACES    TO   TPCSRO
           MOVE     -1        TO   TPCSRL
           MOVE     DFHBMPRF  TO   TMSGMA   TPCSRA

           EXEC     CICS  SEND     MAP     ('RODDB2R')
                                   MAPSET  ('MAPDB2R')
                          FROM             (RODDB2RO)
                          ACCUM    CURSOR
           END-EXEC

           EXEC     CICS  SEND     PAGE      END-EXEC.

           EXEC     CICS  RETURN   COMMAREA (WS-COMM)
                                   TRANSID  ('DB2R')
           END-EXEC.

       140-LIST-DET.
           EXEC     SQL   FETCH    CSR_ASC
                          INTO    :MAT-ALU,
                                  :NOM-ALU, :CUR-ALU, :TUR-ALU,
                                  :END-ALU, :BAI-ALU, :CID-ALU,
                                  :EST-ALU, :EML-ALU, :TEL-ALU
           END-EXEC

           IF  SQLCODE   =    0
               MOVE     MAT-ALU   TO   TMAT1O   TMAT2O
                                       TMAT3O   WS-MATF
               EVALUATE WS-PAGE
                  WHEN  1
                        MOVE     NOM-ALU   TO   TNOMEO
                        MOVE     CUR-ALU   TO   TCURSO
                        MOVE     TUR-ALU   TO   TTURMO
                        MOVE     DFHBMPRF  TO   TMAT1A    TNOMEA
                                                TCURSA    TTURMA

                        EXEC     CICS  SEND     MAP      ('DT1DB2R')
                                                MAPSET   ('MAPDB2R')
                                       FROM              (DT1DB2RO)
                                       ACCUM    ERASE
                        END-EXEC
                  WHEN  2
                        MOVE     END-ALU   TO   TENDRO
                        MOVE     BAI-ALU   TO   TBAIRO
                        MOVE     TEL-ALU   TO   TFONEO
                        MOVE     DFHBMPRF  TO   TMAT2A    TENDRA
                                                TBAIRA    TFONEA

                        EXEC     CICS  SEND     MAP      ('DT2DB2R')
                                                MAPSET   ('MAPDB2R')
                                       FROM              (DT2DB2RO)
                                       ACCUM    ERASE
                        END-EXEC
                  WHEN  3
                        MOVE     CID-ALU   TO   TCIDAO
                        MOVE     EST-ALU   TO   TESTDO
                        MOVE     EML-ALU   TO   TMAILO
                        MOVE     DFHBMPRF  TO   TMAT3A    TCIDAA
                                                TESTDA    TMAILA

                        EXEC     CICS  SEND     MAP      ('DT3DB2R')
                                                MAPSET   ('MAPDB2R')
                                       FROM              (DT3DB2RO)
                                       ACCUM    ERASE
                        END-EXEC
               END-EVALUATE

               ADD      1         TO   WS-LINE.

       200-REC-TELA.
           MOVE     LK-PAGE   TO   WS-PAGE
           MOVE     LK-MATI   TO   WS-MATI
           MOVE     LK-MATF   TO   WS-MATF

           EVALUATE TRUE
              WHEN  EIBAID    =    DFHPF3    OR   WS-MATF  =   0
                    GO  TO    300-FIM-PROG
              WHEN  EIBAID    =    DFHPF7
                    GO  TO    210-PF07-000
              WHEN  EIBAID    =    DFHPF10   OR   DFHPF11
                    GO  TO    230-CHG-PAGE
              WHEN  OTHER
                    EXEC      CICS    SEND   CONTROL   ALARM   END-EXEC
                    GO  TO    110-ATU-DATA
           END-EVALUATE.

       210-PF07-000.
           IF  WS-MATI   =    0
               EXEC      CICS    SEND   CONTROL   ALARM   END-EXEC.

           MOVE     ZEROS     TO   WS-LINE
           MOVE     WS-MATI   TO   MAT-ALU

           EXEC     SQL   OPEN     CSR_DSC   END-EXEC

           PERFORM  210-PF07-010   UNTIL     WS-LINE   >   13
                                   OR        SQLCODE  NOT  =   0

           EXEC     SQL   CLOSE    CSR_DSC   END-EXEC

           COMPUTE  WS-MATI   =    MAT-ALU   -   1
           GO  TO   110-ATU-DATA.

       210-PF07-010.
           EXIT.

       230-CHG-PAGE.
           IF (EIBAID    =    DFHPF10  AND   WS-PAGE   =   1)  OR
              (EIBAID    =    DFHPF11  AND   WS-PAGE   =   3)

               EXEC     CICS  SEND  CONTROL  ALARM  END-EXEC
           ELSE
               IF  EIBAID  =  DFHPF10
                   COMPUTE    WS-PAGE   =    WS-PAGE   -   1
               ELSE
                   COMPUTE    WS-PAGE   =    WS-PAGE   +   1
               END-IF
           END-IF

           GO  TO   110-ATU-DATA.

       300-FIM-PROG.
           EXEC     CICS      XCTL
                    PROGRAM  ('PRGDB2M')
           END-EXEC.
