//JCALCNPJ JOB IBMUSERA,MSGCLASS=A,CLASS=A,NOTIFY=IBMUSER,TIME=(,02)
//JOBLIB   DD DISP=SHR,DSN=FUTURE.LMODUL.COBOL
//*
//STEP1    EXEC PGM=CALCCNPJ
//*
//* CONSISTIR CNPJ INFORMADO VIA SYSIN
//*
//SYSIN    DD *
43450675000145
//*
