//JCALCCPF JOB IBMUSERA,MSGCLASS=A,CLASS=A,NOTIFY=IBMUSER,TIME=(,02)
//JOBLIB   DD DISP=SHR,DSN=FUTURE.LMODUL.COBOL
//*
//STEP1    EXEC PGM=CALCCPFS
//*
//* CONSISTIR CPF INFORMADO VIA SYSIN
//*
//SYSIN    DD *
998208033
//*
