//JEXEPROG JOB IBMUSERA,MSGCLASS=A,CLASS=A,NOTIFY=ALU0407,TIME=(,02)
//JOBLIB   DD DISP=SHR,DSN=FUTURE.LMODUL.COBOL
//*
//STEP1    EXEC PGM=PFERIADO
//*
//*        - PCALCDIG -> INFORMAR CPF/CNPJ SEM O DIGITO
//*        - PGERADOC -> NAO NECESSITA INFORMACAO ADICIONAL
//*        - PFERIADO -> INFORMAR O ANO COM 4 DIGITOS (1700/2300)
//*
//SYSIN    DD *
2022
//*
