//JEXEPROG JOB IBMUSERA,MSGCLASS=A,CLASS=A,NOTIFY=ALU0407,TIME=(,02)
//JOBLIB   DD DISP=SHR,DSN=FUTURE.LMODUL.COBOL
//*
//STEP1    EXEC PGM=PCALCDIG
//*
//*        PARA CALCULAR DIGITO - INFORMAR CPF/CNPJ (SYSIN)
//*
//SYSIN    DD *
000000000001
//*
